app/controllers/admin/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @events = Event.all.reverse

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "events" SET "description" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["description", "hgdeyzgxyekjgxykzgxjzxezxaaa"], ["updated_at", "2019-02-15 14:29:43.274647"], ["id", 8]]
---
  def update
    @event = Event.find(params[:id])
    event_params = params.permit(:title, :description)

      if @event.update(event_params)