app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @events = Event.all.reverse

INSERT INTO "events" ("title", "description", "start_date", "duration", "price", "location", "administrator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @event = Event.new(title: params[:title],
                       description: params[:description],
                       start_date: params[:start_date],
                       duration: params[:duration],
                       price: params[:price],
                       location: params[:location],
                       administrator_id: current_user.id )

    if @event.save # essaie de sauvegarder en base @event

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "description" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["description", "La description était vraiment naze"], ["updated_at", "2019-02-13 22:38:53.068590"], ["id", 6]]
---
  def update
    @event = Event.find(params[:id])
    event_params = params.permit(:title, :description)

      if @event.update(event_params)