app/controllers/users_controller.rb

UPDATE "users" SET "last_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_name", "Marguillar"], ["updated_at", "2019-02-16 13:49:13.790518"], ["id", 1]]
---
  def update
    user_params = params.permit(:first_name, :last_name, :description)

      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def authenticate_user
      @user = User.find(params[:id])